
import { FiscalYear } from './types/coreTypes';

// Nepali Fiscal Years in Devanagari script
export const FISCAL_YEARS: FiscalYear[] = [
  { id: '1', label: '२०८०/०८१', value: '2080/081' },
  { id: '2', label: '२०८१/०८२', value: '2081/082' },
  { id: '3', label: '२०८२/०८३', value: '2082/083' },
  { id: '4', label: '२०८३/०८४', value: '2083/084' },
  { id: '5', label: '२०८४/०८५', value: '2084/085' },
  { id: '6', label: '२०८५/०८६', value: '2085/086' },
  { id: '7', label: '२०८६/०८७', value: '2086/087' },
  { id: '8', label: '२०८७/०८८', value: '2087/088' },
  { id: '9', label: '२०८८/०८९', value: '2088/089' },
  { id: '10', label: '२०८९/०९०', value: '2089/090' },
  { id: '11', label: '२०९०/०९१', value: '2090/091' },
];

export const APP_NAME = "Smart Inventory";
export const ORG_NAME = "स्वास्थ्य संस्था व्यवस्थापन प्रणाली";

export const AVAILABLE_SERVICES = [
  "रेविज विरुद्धको भ्याक्सिन सेवा",
  "हरेक दिन ओ.पि.डि. सेवा",
  "२४ सै घण्टा ईमेरजेन्सी सेवा",
  "फार्मेसी सेवा",
  "ल्याव सेवा",
  "डिजिटल एक्स-रे सेवा",
  "इ.सि.जि. सेवा",
  "नेबुलाईजेसन सेवा",
  "फिजियोथेरापी सेवा",
  "ड्रेसिङ सेवा",
  "सुरक्षित मातृत्व सेवा",
  "पोषण सेवा",
  "खोप सेवा",
  "परिवार नियोजन सेवा",
  "सुरक्षित गर्भपतन सेवा",
  "क्षयरोग, कुष्ठरोग, कालाजार, मलेरिया उपचार सेवा",
  "सर्प दंश उपचार सेवा",
  "२४ सै घण्टा सुरक्षित प्रसुति सेवा",
  "बिजुलि सेवा"

];
